'''Логические выражения оператора Python. NoneType,условные операторы и тернарные операторы'''


'''boolean Type'''
#неизменяемый тип данных, имеет всего 2 значения Ttue/False

# print(bool(0)) #false
# print(bool(-9)) #true
# print(bool('')) #false
# print(bool(True))
# print(bool('False'))

'''Логическое выражения - выражения результатов вычисления которых является True/False'''


# 4 == 2 # False

'''Логические операторы'''
# == -> сравнение
5 == 5 # True
5 == 4 #False
'5' == 5 #False

# != -> не равно
5 != 4 #True
5 != 5 #False

# > -> Больше
# < -> меньше
# >= -> больше или равно
# <= -> меньше или равно


'''===And or not==='''
# 1. and это логическое и 
# 2. or это логичеслое или
# 3. not это лог отрицание

'''
and оперативные используются для
or обьединения лог выражение
'''


a = 7
b = 5

a == 5 and b == 5 #false (левая часть false, правая True ->false)
a == 7 and b == 5 #True (обе части возвращают True ->True)
a == 4 and b == 4 #false (обе части возвращают false -> false)

a == 5 or b == 5 #true (важно чтобы хоьб одна часть выражения бфла true)
a == 7 or b == 5 #true
a == 4 or b == 4 #false

'''превращает в правду ложь, а ложь в правду'''
# print(not True) false
# print(not False) true

not a == 7 #false
not b == 7 #true


'''операторы идентификации'''
# 1. in это проверяет наличие элемента
# 2. сравнение
    # == -> созданение по значением
    # is -> сравнение по ячейкам памяти


'''None Type'''
# неизменяемый имп данных имеет только одно значение None
# print(bool(None))
# print(bool('None'))

'''===Условные операторы==='''
# нужны для того чтобы при разных входных данных код выполнялся по разному

# if условие:
#    тело
   # тело будет работать если условие верно

#if условие:
    #тело
   # тело будет работать если условие верно
#elif условие2:
    # тело2 будет работать когда условие1 и условие2 не верно а условие2 верно
#else:
    #тело3
    # тело3 будет работать когда условие1 и условие2 не верны

# в одной конструкции -> только один if
# в одной конструкции  -> сколько угодно elif
# в одной конструкции  ->  тоько один else

# age = int(input('Введите возраст:'))

# if age >= 18:
#     print('Проходите!')
# else:
#     print('Вход закрыт!!!')

# num от пользователя -> четное/нечетное


# 0/положительно/отрицательное
# num = int(input('Введите число:'))
# if num == 0:
#     print('Zero')
# elif num > 0:
#     print('positive')
# else:
#     print('negative')

'''===Тернарные операторы==='''
# условие в одну строку

'''синтаксис'''
a = 6 
# тело1  if условие else тело2
# print('hellk' if a == else 'Bye')
# res = 'hello' if a == 5 else 'Bye'
# print(res)

# if a == 5:
#     print('hello')
# else:
#     print('Bye')


'''===Маржовые операторы==='''
#  позволяет как привоить так и вернуть значение в олном выражении
# :=
# num = 7
# print(num:=7)
# print(num+3)
# print(num:=7, num2:=8)

