'''======Числа========'''

# Операции над числами

# + - сложные
# num1 = 45
# num2 = 12
# result = num1 + num2
# print(result)

#  - -> вычитание
# num1 = 78
# num2 = 45
# print(num1 - num2)

# / -> деление
# num1 = 80
# num2 = 5
# print(num1 - num2)

# // -> целочисленное деление
# num1 = 80
# num2 = 5
# print(num1//num2)

# * -> умножение 
# num1 = 65
# num2 = 9
# print(num1 * num2)

# % -> получение остатка от деления
# num1 = 7
# num2 = 3
# print(num1 % num2)

# ** -> возведение в степень
# num1 = 5
# num2 = 3
# print(5 ** 3)

# abs() -> модуль (из отрицательного числа сделает положительные)
# print(ads(-19)) # 19
# print(ads(89)) # 8
# print(abs(-2.5)) # 2.5

# pow
# 1. восзводит число в опреределенную степень
# 2. воэвращает остаток от деления 1го результата на 3е число
  
# print(pow(4,6))
# print(pow(4, 6, 3))
# (4 ** 6)%2

# divmod -> принимает два числа и возвращает два числа, первое число -> результат целочисленного деления, а второе число -> остаток от деления
# print(divmod(6,4)) 
 # 6 // 4 = 1
 # 6 % 4 = 2


 # round -> округляет число

# print(round(12.45685))
# print(round(12.689008, 3))

# import math 
# from math import sqrt
# print(sqrt(36))
# sqrt нахождение квадратных корня числа
# print(dir(math))

# print(36 ** (1/2))

# множественное присваивание
# a = 9
# b = 10
# c = 11
  

# from math import pi

# radius = int(input('Введите радиус'))
# p = radius * 2 * pi 
# s = pi * (radius**2)
# print('Площадь:', round(s))
# print('Периметр:', round(p))
